app/controllers/tickets_controller.rb

	def index
	  if (params.has_key?(:ticket_type_id))
	  	@tickets = Ticket.where(:ticket_type_id => params[:ticket_type_id])
	  else
	  	@tickets= Ticket.all
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 1]]

	def show
		@ticket = Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]